{
    "title": "Daniel Valdez",
    "personalJob": "Desarrollador de Software",
    "personalPhrase": "Quiero crear mi propio mundo mientras lo programo.",
    "nav": {
        "principal": "Principal",
        "aboutMe": "Acerca de mí",
        "projects": "Proyectos",
        "experience": "Experiencia"
    },
    "aboutMe": {
        "title": "Acerca de mí",
        "description": "Soy un joven profesional motivado con una imaginación ilimitada y un firme compromiso con la informática. Impulsado por una curiosidad incesante, busco continuamente oportunidades para mejorar mi experiencia en el panorama tecnológico en constante evolución.\n\nActualmente, estoy cursando mis estudios en la Universidad del Valle de Guatemala, una institución reconocida por su excelencia académica y enfoque en la innovación. Aquí, me mantengo en constante formación en las tecnologías más recientes y los sistemas que son utilizados en los entornos laborales más profesionales y exigentes. Esta educación me ha proporcionado una base sólida en áreas como el desarrollo de software, la inteligencia artificial, la ciberseguridad y la gestión de bases de datos.\n\nMi enfoque no solo se limita a lo académico; también participo activamente en proyectos extracurriculares y colaboro con equipos multidisciplinarios para desarrollar soluciones innovadoras. Estas experiencias me han permitido adquirir habilidades prácticas y un entendimiento profundo de cómo aplicar mis conocimientos para resolver problemas del mundo real."
    },
    "experience": {
        "title": "Experiencia",
        "projects": "Proyectos",
        "programming-languages": "Lenguajes de Programación",
        "view_more": "Ver Más",
        "view_project": "Ver Proyecto"
    },
    "projects": {
        "EverythingStarsWithWater": {
            "title": "Todo Empieza Con Agua",
            "description": "Un cautivador sitio web desarrollado con ReactJS que ofrece una experiencia inmersiva de narración visual. Nuestra misión es abordar el desafío crítico relacionado con los recursos hídricos al educar a los estudiantes sobre el ciclo del agua y sus profundas implicaciones para el cambio climático. Este proyecto está diseñado para hacer que el aprendizaje sobre el agua sea atractivo, informativo e impactante."
        },
        "FastApiSocialNetwork": {
            "title": "Fast Api: Red Social",
            "description": "El proyecto FastApi-SocialNetwork es una API desarrollada con FastAPI para una red social, diseñada para ofrecer un alto rendimiento y compatibilidad con Python 3.7+. Utiliza Neo4j para la gestión de datos, proporcionando estructuras robustas de modelos y esquemas Pydantic."
        },
        "SLR": {
            "title": "Analizador Léxico",
            "description": "El proyecto LexicalAnalyzer-LL1-SRL-Scanner combina potentes capacidades de análisis léxico y sintáctico mediante una API desarrollada en Go. Utiliza archivos Yalex para escanear texto y generar tokens, que luego son empleados por una tabla SLR basada en archivos Yalp para análisis sintáctico. Con una interfaz frontend en Angular, proporciona una experiencia intuitiva para interactuar con las funciones de análisis de texto, facilitando tanto el escaneo de textos como el acceso a la tabla SLR."
        },
        "danvaland": {
            "title": "Danvaland",
            "description": "Danvaland te invita a explorar una colección de mis proyectos fascinantes alojados en GitHub. Desde aplicaciones web dinámicas hasta diseños de UI pulidos, descubre mi visión creativa y profunda pasión por la tecnología. Únete a mí en un emocionante viaje a través de soluciones innovadoras y desarrollo de vanguardia."
        },
        "TCP_chat": {
            "title": "Chat TCP",
            "description": "Bienvenido al proyecto de aplicación de chat, una solución avanzada desarrollada en C++ para facilitar la comunicación instantánea entre usuarios. Este proyecto incluye dos componentes principales, client.cpp y server.cpp, diseñados para ofrecer una experiencia fluida y segura de mensajería. Utilizando Google's Protocol Buffers (protobuf) para la transmisión eficiente de datos, nuestra aplicación garantiza una gestión robusta de usuarios registrados y sesiones simultáneas mediante el uso de hilos de ejecución. Los usuarios pueden registrarse con facilidad, solicitar listas de usuarios conectados y disfrutar de una experiencia de chat sin interrupciones. Esta aplicación está diseñada para ser escalable y confiable, proporcionando una plataforma ideal para diversas necesidades de comunicación."
        },
        "Doom_raycasting": {
            "title": "Doom Raycasting",
            "description": "Este proyecto es una demostración técnica de un juego estilo Doom desarrollado en C++, utilizando raycasting para generar gráficos 3D en tiempo real dentro de una consola de texto. Inspirado en clásicos del género de terror, el juego ofrece una experiencia inmersiva y atmosférica, enfocándose en la implementación efectiva de técnicas de renderizado para crear entornos visualmente impactantes y tensos. Se compila y ejecuta fácilmente mediante el script run.sh, proporcionando una muestra accesible del potencial del raycasting en la creación de juegos."
        },
        "B-line": {
            "title": "B-Line",
            "description": "B-Line es una aplicación móvil desarrollada en Kotlin dentro del entorno de Android Studio. Su objetivo es optimizar el proceso de búsqueda de artículos o productos deseados en línea al ofrecer un motor de búsqueda robusto que escanea varios sitios web, organiza los resultados de manera lógica y muestra sus precios y fuentes. Además, permite a los usuarios filtrar los resultados por categoría y guardar los artículos favoritos para un acceso fácil. B-Line mejora la experiencia de compra en línea al proporcionar una plataforma centralizada para descubrir y gestionar productos de manera eficiente."
        },
        "Raycaster" :{
            "title": "Raycaster",
            "description": "Este proyecto demuestra un motor de raycasting simple para renderizar una diorama con temática de Minecraft. La escena incluye bloques que representan diferentes materiales como luz, oro, diamante, esmeralda y baliza. Cada material tiene propiedades ópticas específicas como reflexión y refracción."
        }
    }
}
